{
  "users": [
    {
      "id": "0",
      "email": "test@gmail.com",
      "password": "admin",
      "username": "admin"
    },
    {
      "email": "igor@igor",
      "password": "$2a$10$KQ4zTp8PeWI7zXt43CroKejRNIX5N3bvyB6MtsI9hF.ajzqaZkFLy",
      "username": "igor",
      "id": "2TZ0OGr"
    },
    {
      "email": "root@root",
      "password": "$2a$10$zJPZb4tBXrZQcHgKSKEYlu2vjH0lQcIW9OAqyAU.NkwSUA2shNx7y",
      "username": "root",
      "id": "RVZ5cwh"
    }
  ],
  "developers": [
    {
      "id": "1a2dfgae231",
      "email": "Lol@mail.ru",
      "firstName": "Сергей",
      "secondName": "Климовский",
      "post": "Художник, разработчик анимаций и UI",
      "img": "/images/developers/1.png",
      "password": "123456",
      "description": "Климовский Сергей студент группы УВТп41, разработчик нашей игры, он отвечает за все то, что вы будете видеть непосредственно в игре, а именно \n -работа над персонажами\n -анимации\n -интерфейс игры\n Если о каждом пункте отдельно: \n Компьютерная анимация — последовательный показ (слайд-шоу) заранее подготовленных графических файлов, а также компьютерная имитация движения с помощью изменения (и перерисовки) формы объектов или показа последовательных изображений с фазами движения.\n UI (User Interface) — пользовательский интерфейс. Данный IT-термин обозначает визуальную часть интерфейса. Является главным элементом, формирующим UX, определяя все визуальные, интерактивные элементы интерфейса продукта, включая кнопки, значки, интервалы, типографику, цветовые схемы и адаптивный дизайн.\n Дизайн персонажа - комплект графических изображений, включающих визуальный образ героя мультфильма, схемы, чертежи и эскизы, необходимые для последующего одушевления (анимации) персонажа.\n Как правило, графическая разработка персонажа создаётся художником по персонажам."
    },
    {
      "id": "54o23jmfs",
      "email": "BRVx9@gmail.ru",
      "firstName": "Данила",
      "secondName": "Лапшин",
      "post": "Разработчик алгоритма генерации карт",
      "img": "/images/developers/2.jpg",
      "password": "qwerty",
      "description": "Моей задачей в данном проекте является генерация карт, на которых будут происходить действия игры.\nГлавной отличительной особенностью подобного подхода к дизайну уровней является то, что у каждого игрока вид карты будет отличаться, так как генерируется в реальном времени с помощью специального алгоритма, частично использующего в своей основе нейросети для обучения."
    },
    {
      "id": "lkhag345hsad",
      "email": "iifia@bk.ru",
      "firstName": "Артем",
      "secondName": "Кучеренко",
      "post": "Разработчик игровых механик, геймдизайнер, программист",
      "img": "/images/developers/3.jpg",
      "password": "12345678",
      "description": "Кучеренко Артем студент группы УВТп41, разработчик нашей игры, он отвечает за игровые механики, а именно \n -работа над созданием магических заклинаний и внедрение их в игру\n -разработка артефактов и адаптация под юнитов\n -разработка уровней\n Если о каждом пункте отдельно: \n Магические заклинания - механика, позволяющая осуществить непосредственное взаимодействие персонажа с другими юнитами и окружением. В этот пункт входит весь процесс от появления идеи до реализации программного кода\n Артефакты — специальные внутреигровые предметы, позволяющие влиять на персонажа и других юнитов, путем использования данных предметов, изменяя параметры юнитов, также включает весь процесс от создания идеи до реализации программного кода\n Дизайн уровней - процесс проектирования уровней, расположения объектов, предметов и юнитов на карте, программная связь данных объектов между собой"
    }
  ]
}